uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1_UABH_B.c
/*!*****************************************************************************
* \file ADC_1_UABH_B.c
* \version 1.10
*
* \brief 
*   API for Universal Analog Block (UAB)
*
********************************************************************************
* \copyright
* (c) 2014-2016, Cypress Semiconductor Corporation. All rights reserved.
* This software, including source code, documentation and related
* materials ("Software"), is owned by Cypress Semiconductor
* Corporation ("Cypress") and is protected by and subject to worldwide
* patent protection (United States and foreign), United States copyright
* laws and international treaty provisions. Therefore, you may use this
* Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, nonexclusive,
* non-transferable license to copy, modify, and compile the
* Software source code solely for use in connection with Cypress's
* integrated circuit products. Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO
* WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING,
* BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
* PARTICULAR PURPOSE. Cypress reserves the right to make
* changes to the Software without notice. Cypress does not assume any
* liability arising out of the application or use of the Software or any
* product or circuit described in the Software. Cypress does not
* authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*******************************************************************************/


#include "cytypes.h"
#include "ADC_1_UABH_B_CyUAB_types.h"
#include "ADC_1_UABH_B_CyUAB.h"
#include "ADC_1_UABH_B_param.h"
#include "ADC_1_UABH_B_regs.h"
#include "ADC_1_UABH_B.h"


/*General*/

uint32 ADC_1_UABH_B_initVar = 0UL; /**< 0 if component is uninitialized. 1 otherwise. */

/*!
* \addtogroup group_init
* @{
*/

/*! Part of default configuration used to initialize UAB in ADC_1_UABH_B_Start() */
uint16 ADC_1_UABH_B_waveConfig[ADC_1_UABH_B_NUM_STEPS] = {
/*0<=last_step<=15 , so always at least one step*/
((uint16)ADC_1_UABH_B_PARAM_WAVE_STEP_0)

#if ADC_1_UABH_B_INC_STEP_1
,((uint16)ADC_1_UABH_B_PARAM_WAVE_STEP_1)
#endif
#if ADC_1_UABH_B_INC_STEP_2
,((uint16)ADC_1_UABH_B_PARAM_WAVE_STEP_2)
#endif
#if ADC_1_UABH_B_INC_STEP_3
,((uint16)ADC_1_UABH_B_PARAM_WAVE_STEP_3)
#endif
#if ADC_1_UABH_B_INC_STEP_4
,((uint16)ADC_1_UABH_B_PARAM_WAVE_STEP_4)
#endif
#if ADC_1_UABH_B_INC_STEP_5
,((uint16)ADC_1_UABH_B_PARAM_WAVE_STEP_5)
#endif
#if ADC_1_UABH_B_INC_STEP_6
,((uint16)ADC_1_UABH_B_PARAM_WAVE_STEP_6)
#endif
#if ADC_1_UABH_B_INC_STEP_7
,((uint16)ADC_1_UABH_B_PARAM_WAVE_STEP_7)
#endif
#if ADC_1_UABH_B_INC_STEP_8
,((uint16)ADC_1_UABH_B_PARAM_WAVE_STEP_8)
#endif
#if ADC_1_UABH_B_INC_STEP_9
,((uint16)ADC_1_UABH_B_PARAM_WAVE_STEP_9)
#endif
#if ADC_1_UABH_B_INC_STEP_10
,((uint16)ADC_1_UABH_B_PARAM_WAVE_STEP_10)
#endif
#if ADC_1_UABH_B_INC_STEP_11
,((uint16)ADC_1_UABH_B_PARAM_WAVE_STEP_11)
#endif
#if ADC_1_UABH_B_INC_STEP_12
,((uint16)ADC_1_UABH_B_PARAM_WAVE_STEP_12)
#endif
#if ADC_1_UABH_B_INC_STEP_13
,((uint16)ADC_1_UABH_B_PARAM_WAVE_STEP_13)
#endif
#if ADC_1_UABH_B_INC_STEP_14
,((uint16)ADC_1_UABH_B_PARAM_WAVE_STEP_14)
#endif
#if ADC_1_UABH_B_INC_STEP_15
,((uint16)ADC_1_UABH_B_PARAM_WAVE_STEP_15)
#endif
};

/*! Part of default configuration used to initialize UAB in ADC_1_UABH_B_Start() */
CyUAB_reg_pair ADC_1_UABH_B_initPairs[ADC_1_UABH_B_INIT_PAIRS_COUNT] = {

	/*OA_CTRL default always first element in initPairs*/
#if ADC_1_UABH_B_NONZERO_OA_CTRL
    {ADC_1_UABH_B_OA_CTRL_PTR         , ((uint32)ADC_1_UABH_B_DEFAULT_OA_CTRL)}
#endif
#if ADC_1_UABH_B_NONZERO_SW_STATIC
    ,{ADC_1_UABH_B_SW_STATIC_PTR      , ((uint32)ADC_1_UABH_B_DEFAULT_SW_STATIC)}
#endif
#if ADC_1_UABH_B_NONZERO_SW_MODBIT_SRC
    ,{ADC_1_UABH_B_SW_MODBIT_SRC_PTR  , ((uint32)ADC_1_UABH_B_DEFAULT_SW_MODBIT_SRC)}
#endif
#if ADC_1_UABH_B_NONZERO_SRAM_CTRL
    ,{ADC_1_UABH_B_SRAM_CTRL_PTR      , ((uint32)ADC_1_UABH_B_DEFAULT_SRAM_CTRL)} 
#endif





#if ADC_1_UABH_B_NONZERO_INTR_MASK	
    ,{ADC_1_UABH_B_INTR_MASK_PTR      , ((uint32)ADC_1_UABH_B_DEFAULT_INTR_MASK)}
#endif
#if ADC_1_UABH_B_NONZERO_CAP_CTRL
    ,{ADC_1_UABH_B_CAP_CTRL_PTR       , ((uint32)ADC_1_UABH_B_DEFAULT_CAP_CTRL)}
#endif
#if ADC_1_UABH_B_NONZERO_CAP_ABCF_VAL
    ,{ADC_1_UABH_B_CAP_ABCF_VAL_PTR   , ((uint32)ADC_1_UABH_B_DEFAULT_CAP_ABCF_VAL)}
#endif
#if ADC_1_UABH_B_NONZERO_CAP_AB_VAL_NXT
    ,{ADC_1_UABH_B_CAP_AB_VAL_NXT_PTR , ((uint32)ADC_1_UABH_B_DEFAULT_CAP_AB_VAL_NXT)}
#endif
#if ADC_1_UABH_B_NONZERO_CAP_CF_VAL_NXT
    ,{ADC_1_UABH_B_CAP_CF_VAL_NXT_PTR , ((uint32)ADC_1_UABH_B_DEFAULT_CAP_CF_VAL_NXT)}
#endif
#if ADC_1_UABH_B_NONZERO_STARTUP_DELAY
    ,{ADC_1_UABH_B_STARTUP_DELAY_PTR  , ((uint32)ADC_1_UABH_B_DEFAULT_STARTUP_DELAY)}
#endif
#if ADC_1_UABH_B_NONZERO_SUBSAMPLE_CTRL
    ,{ADC_1_UABH_B_SUBSAMPLE_CTRL_PTR , ((uint32)ADC_1_UABH_B_DEFAULT_SUBSAMPLE_CTRL)}
#endif
#if ADC_1_UABH_B_NONZERO_SW_CA_IN0
    ,{ADC_1_UABH_B_SW_CA_IN0_PTR      , ((uint32)ADC_1_UABH_B_DEFAULT_SW_CA_IN0)}
#endif
#if ADC_1_UABH_B_NONZERO_SW_CA_IN1
    ,{ADC_1_UABH_B_SW_CA_IN1_PTR      , ((uint32)ADC_1_UABH_B_DEFAULT_SW_CA_IN1)}
#endif
#if ADC_1_UABH_B_NONZERO_SW_CA_TOP
    ,{ADC_1_UABH_B_SW_CA_TOP_PTR      , ((uint32)ADC_1_UABH_B_DEFAULT_SW_CA_TOP)}
#endif
#if ADC_1_UABH_B_NONZERO_SW_CB_IN0
    ,{ADC_1_UABH_B_SW_CB_IN0_PTR      , ((uint32)ADC_1_UABH_B_DEFAULT_SW_CB_IN0)}
#endif
#if ADC_1_UABH_B_NONZERO_SW_CB_IN1
    ,{ADC_1_UABH_B_SW_CB_IN1_PTR      , ((uint32)ADC_1_UABH_B_DEFAULT_SW_CB_IN1)}
#endif
#if ADC_1_UABH_B_NONZERO_SW_CB_TOP
    ,{ADC_1_UABH_B_SW_CB_TOP_PTR      , ((uint32)ADC_1_UABH_B_DEFAULT_SW_CB_TOP)}
#endif
#if ADC_1_UABH_B_NONZERO_SW_CC_IN0
    ,{ADC_1_UABH_B_SW_CC_IN0_PTR      , ((uint32)ADC_1_UABH_B_DEFAULT_SW_CC_IN0)}
#endif
#if ADC_1_UABH_B_NONZERO_SW_CC_IN1
    ,{ADC_1_UABH_B_SW_CC_IN1_PTR      , ((uint32)ADC_1_UABH_B_DEFAULT_SW_CC_IN1)}
#endif
#if ADC_1_UABH_B_NONZERO_SW_CC_TOP
    ,{ADC_1_UABH_B_SW_CC_TOP_PTR      , ((uint32)ADC_1_UABH_B_DEFAULT_SW_CC_TOP)}
#endif
#if ADC_1_UABH_B_NONZERO_SW_CF_BOT
    ,{ADC_1_UABH_B_SW_CF_BOT_PTR      , ((uint32)ADC_1_UABH_B_DEFAULT_SW_CF_BOT)}
#endif
#if ADC_1_UABH_B_NONZERO_SW_OTHER
    ,{ADC_1_UABH_B_SW_OTHER_PTR       , ((uint32)ADC_1_UABH_B_DEFAULT_SW_OTHER)}
#endif
#if ADC_1_UABH_B_NONZERO_SW_BOOST_CTRL
    ,{ADC_1_UABH_B_SW_BOOST_CTRL_PTR  , ((uint32)ADC_1_UABH_B_DEFAULT_SW_BOOST_CTRL)}
#endif


