uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1_UABH_B.c
};

/*! Default configuration used to initialize UAB in ADC_1_UABH_B_Start() */
CyUAB_config ADC_1_UABH_B_config = {
    ADC_1_UABH_B_waveConfig,
    ADC_1_UABH_B_initPairs,
    CyUAB_SHARED_SW_CFG(ADC_1_UABH_B_PARAM_REF_TIED,ADC_1_UABH_B_PARAM_AGND_TIED,
        ADC_1_UABH_B_PARAM_SW_CC,ADC_1_UABH_B_PARAM_SW_BB,ADC_1_UABH_B_PARAM_SW_AA),
    ADC_1_UABH_B_NUM_STEPS,
    (uint8)(ADC_1_UABH_B_ELEMENT_COUNT(ADC_1_UABH_B_initPairs))
};

/*! @} group_init */


/************** ADC_1_UABH_B_Start() **************************************/
/*!
* @brief Initializes and enables the component.
* 
* @details This function is equivalent to calling 
* ADC_1_UABH_B_Enable(), ADC_1_UABH_B_Init(&ADC_1_UABH_B_config), and ADC_1_UABH_B_Run(1UL).  
* Takes no parameters.  Returns @c void.
* 
* @internal
* @reglist
* @image html SetTopSwitch.png
* @endinternal
* 
* @see ADC_1_UABH_B_Enable()
* @see ADC_1_UABH_B_Init()
* @see ADC_1_UABH_B_Run()
* @see ADC_1_UABH_B_Stop()
*
* @sideeffect Sets ENABLED bit for whole UAB - both half0 and half1.
*
* \globalvars
*  \ref ADC_1_UABH_B_initVar (RW)
*
*******************************************************************************/
void ADC_1_UABH_B_Start(void)
{
    if (ADC_1_UABH_B_initVar != 1UL)
    {
        ADC_1_UABH_B_Init(&ADC_1_UABH_B_config);
        ADC_1_UABH_B_initVar = 1UL;
    }
    else 
    {
        /* Already initialized - empty */
    }
    
    /*no delay required between Enable() and Run(1) - run bit control logic handles UAB ramp up*/
    ADC_1_UABH_B_Run(1UL); /*set the run bit*/
}

/************* ADC_1_UABH_B_Stop() ****************************************/
/*!
* @brief Stops component functionality.
* 
* @details Disables the clocks.  Call this before modifying the UAB configuration.
* Takes no parameters.  Returns @c void.
* 
* @internal
* @reglist
* @endinternal
* 
* @see ADC_1_UABH_B_Start()
* @see ADC_1_UABH_B_Run()
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_Stop(void)
{
    ADC_1_UABH_B_Run(0UL); /*Clear run bit*/
    /*Intentionally not clearing the enable bit because it has a side-effect - 
	the enable bit is shared with another UAB half*/
}


/* Support function for ADC_1_UABH_B_Init() */
void ADC_1_UABH_B_WriteInitPairs(const CyUAB_reg_pair pairs[], size_t n)
{
    uint32 i;
    for( i = 0UL; i < n; i++ )
    {
        CY_SET_REG32( pairs[i].addr, pairs[i].value );
    }    
}




    


/*************** ADC_1_UABH_B_Init() **************************************/
/*!
* @brief Initializes component settings.
* 
* @details Enables UAB and sets initial configurations, but does not start clocking.
*
* @param cfg pointer to a UAB configuration
* Returns @c void.
*
* Start() is the preferred way to enable the UAB.
*
* Can be used for dynamic reconfiguration - must create configurations that handle
* the deltas between them including clearing registers.
* 
* @internal
* @reglist all
* @endinternal
* 
* @see ADC_1_UABH_B_Start()
* @see ADC_1_UABH_B_Enable()
* 
* @sideeffect Sets ENABLED bit for whole UAB - both half0 and half1.
*******************************************************************************/
void ADC_1_UABH_B_Init(const CyUAB_config * cfg)
{
#if ADC_1_UABH_B_ISPAIRED 
    CyUAB_agnd_tied_enum agndTied;
    CyUAB_ref_tied_enum refTied;
    CyUAB_clk_enum clk_AA;
    CyUAB_clk_enum clk_BB;
    CyUAB_clk_enum clk_CC;
#endif

    ADC_1_UABH_B_Enable();
    
    CyUAB_SetNSteps( ADC_1_UABH_B_SRAM0_PTR, ((size_t)(cfg->stepCount)), (cfg->waveSteps) );
    
    /* Optimized version of ClearAllClocks() -- 
    Clear remaining wavesteps, so clock editing with SetClock() works
    */
    (void)CyUAB_wordset( 
        ((reg32*)( ((uint32)(ADC_1_UABH_B_SRAM0_PTR)) + (((uint32)(cfg->stepCount))*sizeof(uint32)) )), 
        0UL, 
        ( ( CyUAB_STEPS_LEN_MAX - ((uint32)(cfg->stepCount)) ) * sizeof(uint32) )
    );
    
    ADC_1_UABH_B_WriteInitPairs( cfg->pairs, ((size_t)(cfg->pairCount)) );
    /* ^ 
    *  | 
    *  | 
    *  Direct writes must happen before writing shared switch fields*/
    
    
#if ADC_1_UABH_B_ISPAIRED
    /*Handle shared switches - switches that connect paired UABPRIM instances*/
    agndTied = CyUAB_SHARED_SW_CFG_AGNDTIED( cfg->shared_sw );
    ADC_1_UABH_B_SetAgndTied( agndTied );
    refTied = CyUAB_SHARED_SW_CFG_REFTIED(  cfg->shared_sw );
    ADC_1_UABH_B_SetRefTied( refTied );
    clk_AA = CyUAB_SHARED_SW_CFG_AA(  cfg->shared_sw );
    ADC_1_UABH_B_SetSwitch( CyUAB_SW_AA, clk_AA );
    clk_BB = CyUAB_SHARED_SW_CFG_BB(  cfg->shared_sw );
    ADC_1_UABH_B_SetSwitch( CyUAB_SW_BB, clk_BB );
    clk_CC = CyUAB_SHARED_SW_CFG_CC(  cfg->shared_sw );
    ADC_1_UABH_B_SetSwitch( CyUAB_SW_CC, clk_CC );
#endif
    
}

/************** ADC_1_UABH_B_Enable() *************************************/
/*!
* @brief Enables the component.
* 
* @details Provides power to the op-amp, charge pump, comparator, and reference 
* buffers.  Enable() does not enable the clocking.  Call Run(1UL) to enable clocking.
* Takes no parameters.  Returns @c void.
*
* Start() is the preferred way to enable the UAB if all of your configuration is 
* captured in symbol parameters.
*
* NOTE: The ENABLED bit controls both half0 and half1 within a UAB pair.
*
* Disable() is not implemented.
* Clearing the ENABLED bit has the side effect of disabling both halves.
* How to disable:
* ADC_1_UABH_B_UAB_CTRL_REG &= ~ADC_1_UABH_B_ENABLED_MASK;
*
* The actual power settings are Controlled by the power setting functions.
* 
* @internal
* @reglist
* @endinternal
* 
* @see ADC_1_UABH_B_Start()
* @see ADC_1_UABH_B_Init()
* @see ADC_1_UABH_B_SetUABPower()
* @see ADC_1_UABH_B_SetOAPower()
* @see ADC_1_UABH_B_SetCompPower()
* @see ADC_1_UABH_B_SetRefPower()
* @see ADC_1_UABH_B_SetAgndPower()
* 
* @sideeffect Sets ENABLED bit for whole UAB - both half0 and half1.
*******************************************************************************/
void ADC_1_UABH_B_Enable(void)
{
    ADC_1_UABH_B_UAB_CTRL_REG |= ADC_1_UABH_B_ENABLED_MASK; /*Side effect: also enables other UAB half in same pair*/
}


/*Interrupts*/


/*********** ADC_1_UABH_B_ClearInterrupt() ********************************/
/*!
* @brief Reset an interrupt request bit. 
* 
* @details After an interrupt has been fired, this function resets the interrupt 
* so it can fire again. Returns @c void.
* 
* @param intr 
* @arg CyUAB_INTR_COMP select comparator interrupt
* @arg CyUAB_INTR_VDAC_EMPTY select VDAC empty interrupt
*
* @internal
* @reglist @reg ADC_1_UABH_B_INTR_REG
* @endinternal
* 
* @see ADC_1_UABH_B_SetInterrupt()
* 
* @see ADC_1_UABH_B_SetInterruptMask()
* @see ADC_1_UABH_B_ClearInterruptMask()
* @see ADC_1_UABH_B_GetInterruptIsMasked()
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_ClearInterrupt(CyUAB_intr_enum intr)
{
    /* Write '1' to the register bit field to clear the interrupt bit. */
    /*intentionally omitting decimator interrupt - handled in decimator component*/    

    uint32 mask = ( (CyUAB_INTR_COMP==intr)      ? ((uint32)ADC_1_UABH_B_INTR_COMP_MASK) : 
                  ( (CyUAB_INTR_VDAC_EMPTY==intr)? ((uint32)ADC_1_UABH_B_INTR_VDAC_EMPTY_MASK) : 
                  0UL ) );
    if(0UL!=mask)
    {
        *(ADC_1_UABH_B_INTR_PTR) |= mask;    
    }
}

