uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1_UABH_B.c
/************* ADC_1_UABH_B_SetInterrupt() ********************************/
/*!
* @brief Sets the bit in the interrupt request register.
* 
* @details Set the bit to activate a certain interrupt request. Returns @c void.
* 
* @param intr 
* @arg CyUAB_INTR_COMP select comparator interrupt
* @arg CyUAB_INTR_VDAC_EMPTY select VDAC empty interrupt
*
* @internal
* @reglist @reg ADC_1_UABH_B_INTR_SET_REG
* @endinternal
*
* 
* @see ADC_1_UABH_B_ClearInterrupt()
* @see ADC_1_UABH_B_SetInterruptMask()
* @see ADC_1_UABH_B_ClearInterruptMask()
* @see ADC_1_UABH_B_GetInterruptIsMasked()
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetInterrupt(CyUAB_intr_enum intr)
{
    /* Write with '1' to set corresponding bit in interrupt request register. */
    /*intentionally omitting decimator interrupt - handled in decimator component*/
    
    uint32 mask = ( (CyUAB_INTR_COMP==intr)      ? ((uint32)ADC_1_UABH_B_INTR_COMP_MASK) : 
                  ( (CyUAB_INTR_VDAC_EMPTY==intr)? ((uint32)ADC_1_UABH_B_INTR_VDAC_EMPTY_MASK) : 
                  0UL ) );
    if(0UL!=mask)
    {
        *(ADC_1_UABH_B_INTR_SET_PTR) |= mask;
    }
}

/************** ADC_1_UABH_B_SetInterruptMask() ***************************/
/*!
* @brief Sets the mask bit for the passed interrupt.
* 
* @details Set the mask bit for setting an interrupt request. Returns @c void.
* 
* @param intr 
* @arg CyUAB_INTR_COMP select comparator interrupt
* @arg CyUAB_INTR_VDAC_EMPTY select VDAC empty interrupt
*
* @internal
* @reglist @reg ADC_1_UABH_B_INTR_MASK_REG
* @endinternal
* 
* @see ADC_1_UABH_B_SetInterrupt()
* @see ADC_1_UABH_B_ClearInterrupt()
* 
* @see ADC_1_UABH_B_ClearInterruptMask()
* @see ADC_1_UABH_B_GetInterruptIsMasked()
*
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetInterruptMask(CyUAB_intr_enum intr)
{
    /* Write with '1' to set interrupt mask*/
    /*intentionally omitting decimator interrupt - handled in decimator component*/
    
    uint32 mask = ( (CyUAB_INTR_COMP==intr)      ? ((uint32)ADC_1_UABH_B_INTR_COMP_MASK) : 
                  ( (CyUAB_INTR_VDAC_EMPTY==intr)? ((uint32)ADC_1_UABH_B_INTR_VDAC_EMPTY_MASK) : 
                  0UL ) );
    if(0UL!=mask)
    {
        *(ADC_1_UABH_B_INTR_MASK_PTR) |= mask;    
    }
}

/************* ADC_1_UABH_B_ClearInterruptMask() **************************/
/*!
* @brief Clears the mask bit for the passed interrupt.
* 
* @details Clear the mask bit for setting an interrupt request. Returns @c void.
* 
* @param intr 
* @arg CyUAB_INTR_COMP select comparator interrupt
* @arg CyUAB_INTR_VDAC_EMPTY select VDAC empty interrupt
*
* @internal
* @reglist @reg ADC_1_UABH_B_INTR_MASK_REG
* @endinternal
* 
* @see ADC_1_UABH_B_SetInterrupt()
* @see ADC_1_UABH_B_ClearInterrupt()
* @see ADC_1_UABH_B_SetInterruptMask()
* 
* @see ADC_1_UABH_B_GetInterruptIsMasked()
* 
* @sideeffect None
******************************************************************************/
void ADC_1_UABH_B_ClearInterruptMask(CyUAB_intr_enum intr)
{
    /* Write with '0' to clear interrupt mask*/
    /*intentionally omitting decimator interrupt - handled in decimator component*/
    
    uint32 mask = ( (CyUAB_INTR_COMP==intr)      ? ~((uint32)ADC_1_UABH_B_INTR_COMP_MASK) : 
                  ( (CyUAB_INTR_VDAC_EMPTY==intr)? ~((uint32)ADC_1_UABH_B_INTR_VDAC_EMPTY_MASK) : 
                  0xFFFFFFFFUL ) );
    if(0xFFFFFFFFUL!=mask)
    {
        *(ADC_1_UABH_B_INTR_MASK_PTR) &= mask;    
    }
}

/********** ADC_1_UABH_B_GetInterruptIsMasked() ***************************/
/*!
* @brief Check for interrupt masked.
* 
* @details Return type is @c uint32 32-bit unsigned integer. Returns 1 if the passed 
interrupt is both masked and requested. Returns 0 otherwise.
* 
* @param intr 
* @arg CyUAB_INTR_COMP select comparator interrupt
* @arg CyUAB_INTR_VDAC_EMPTY select VDAC empty interrupt
*
* @internal
* @reglist ADC_1_UABH_B_INTR_MASKED_REG
* @endinternal
*
* @see ADC_1_UABH_B_SetInterrupt()
* @see ADC_1_UABH_B_ClearInterrupt()
* @see ADC_1_UABH_B_SetInterruptMask()
* @see ADC_1_UABH_B_ClearInterruptMask()
* 
*
* @sideeffect None
*******************************************************************************/
uint32 ADC_1_UABH_B_GetInterruptIsMasked(CyUAB_intr_enum intr)
{
    uint32 r; /*return value*/
    
    /*intentionally omitting decimator interrupt - handled in decimator component*/
    
    uint32 mask = ( (CyUAB_INTR_COMP==intr)      ? ((uint32)ADC_1_UABH_B_INTR_COMP_MASK) : 
                  ( (CyUAB_INTR_VDAC_EMPTY==intr)? ((uint32)ADC_1_UABH_B_INTR_VDAC_EMPTY_MASK) : 
                  0UL ) );
    
    r = ( 0UL != ( (*(ADC_1_UABH_B_INTR_MASKED_PTR)) & mask ) ) ? 1UL : 0UL;
    return r;
}

/*Power*/

/***************** ADC_1_UABH_B_SetUABPower() *****************************/
/*!
* @brief Sets the UAB half's power mode.
* 
* @details The UAB half has several power modes available.  This sets the power
* reference that is used for the active components as well, that is, the op-amp
* and comparator have settings that are HI, MED, and LOW relative to the entire
* UAB half's power.
* 
* @internal
* @reglist @reg ADC_1_UABH_B_OA0_CTRL @reg ADC_1_UABH_B_OA1_CTRL
* @endinternal
* 
* @see ADC_1_UABH_B_Stop()
* @see ADC_1_UABH_B_SetOAPower()
* @see ADC_1_UABH_B_SetCompPower()
* @see ADC_1_UABH_B_SetRefPower()
* @see ADC_1_UABH_B_SetAgndPower()
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetUABPower(CyUAB_coarse_pwr_enum powerLevel)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_OA_CTRL_PTR, 
      ADC_1_UABH_B_UAB_PWR_MASK, 
      ((uint32)powerLevel), 
      ADC_1_UABH_B_UAB_PWR_SHIFT
    );
}


/************* ADC_1_UABH_B_SetOAPower() **********************************/
/*!
* @brief Set the op-amp power level.
* 
* @details The power of the op-amp is relative to the power mode of the UAB. 
* This function sets that relative setting.  Returns @c void.
* 
* @internal
* @reglist @reg ADC_1_UABH_B_OA0_CTRL @reg ADC_1_UABH_B_OA1_CTRL
* @image html _.png 
* @endinternal
* 
* @see ADC_1_UABH_B_SetUABPower()
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetOAPower(CyUAB_fine_pwr_enum powerLevel)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_OA_CTRL_PTR, 
      ADC_1_UABH_B_OA_PWR_MASK, 
      ((uint32)powerLevel), 
      ADC_1_UABH_B_OA_PWR_SHIFT
    );
}


/******************** ADC_1_UABH_B_SetCompPower() *************************/
/*!
* @brief Set the comparator power level.
* 
* @details The power of the comparator is relative to the power mode of the UAB.
* This function sets that relative setting.  Returns @c void.
* 
* @internal
* @reglist @reg ADC_1_UABH_B_OA0_CTRL @reg ADC_1_UABH_B_OA1_CTRL
* @image html SetCompPower.png 
* @endinternal
*
* @see ADC_1_UABH_B_SetUABPower()
*
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetCompPower(CyUAB_fine_pwr_enum powerLevel)
{  
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_OA_CTRL_PTR, 
      ADC_1_UABH_B_CMP_PWR_MASK, 
      ((uint32)powerLevel), 
      ADC_1_UABH_B_CMP_PWR_SHIFT
    );
}


/***************** ADC_1_UABH_B_SetRefPower *******************************/
/*!
* @brief Set the power level of the buffer for the reference voltage.
* 
* @details There are two buffered inputs: reference and analog-ground.  This 
* function sets the power of the reference buffer--which connects to the 
* ADC_1_UABH_B_NET_REF signal--relative to the power mode of the UAB. Returns @c void.
* 
* @internal
* @reglist @reg ADC_1_UABH_B_OA0_CTRL @reg ADC_1_UABH_B_OA1_CTRL
* @image html SetRefPower.png 
* @endinternal
* 
* @see ADC_1_UABH_B_SetUABPower()
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetRefPower(CyUAB_fine_pwr_enum powerLevel)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_OA_CTRL_PTR, 
      ADC_1_UABH_B_REF_PWR_MASK, 
      ((uint32)powerLevel), 
      ADC_1_UABH_B_REF_PWR_SHIFT
    );
}


/**************** ADC_1_UABH_B_SetAgndPower() *****************************/
/*!
* @brief Set the power level of the buffer for the analog-ground voltage.
* 
* @details There are two buffered inputs: reference and analog-ground.  This 
* function sets the power of the analog-ground buffer--which connects to the 
* ADC_1_UABH_B_NET_REF signal--relative to the power mode of the UAB. Returns @c void.
* 
* @internal
* @reglist @reg ADC_1_UABH_B_OA0_CTRL @reg ADC_1_UABH_B_OA1_CTRL
* @image html SetAgndPower.png 
* @endinternal
* 
* @see ADC_1_UABH_B_SetUABPower()
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetAgndPower(CyUAB_fine_pwr_enum powerLevel)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_OA_CTRL_PTR, 
      ADC_1_UABH_B_AGND_PWR_MASK, 
      ((uint32)powerLevel), 
      ADC_1_UABH_B_AGND_PWR_SHIFT
    );
}


/**************** ADC_1_UABH_B_SetRefVdda() *******************************/
/*!
* @brief Force buffered ref to VDDA.
* 
* @details Replace ref buffer output with VDDA (REFx_PTS). Returns @c void.
*
* @param forceVdda
* @arg 0 use routed reference
* @arg 1 use vdda for reference 
*
* @internal
* @reglist @reg ADC_1_UABH_B_OA0_CTRL @reg ADC_1_UABH_B_OA1_CTRL
* @image html _.png 
* @endinternal
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetRefVdda(CyUAB_ref_force_vdda_enum forceVdda)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_OA_CTRL_PTR, 
      ADC_1_UABH_B_REF_PTS_MASK, 
      ((uint32)forceVdda), 
      ADC_1_UABH_B_REF_PTS_SHIFT
    );
}


