uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1_UABH_B.c
/*************** ADC_1_UABH_B_SetAgndVdda() *******************************/
/*!
* @brief Force buffered agnd to VDDA.
* 
* @details Replace analog ground buffer output with VDDA. (AGNDx_PTS). Returns @c void.
* 
* @param forceVdda
* @arg 0 use routed reference
* @arg 1 use vdda for reference
*
* @internal
* @reglist @reg ADC_1_UABH_B_OA0_CTRL @reg ADC_1_UABH_B_OA1_CTRL
* @image html _.png 
* @endinternal
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetAgndVdda(CyUAB_agnd_force_vdda_enum forceVdda)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_OA_CTRL_PTR, 
      ADC_1_UABH_B_AGND_PTS_MASK, 
      ((uint32)forceVdda), 
      ADC_1_UABH_B_AGND_PTS_SHIFT
    );
}


/************* ADC_1_UABH_B_SetRefTied() **********************************/
/*!
* @brief Ties the outputs of the reference buffers of the two UAB-halves together.
* 
* @details The reference buffers of this half-UAB and its sibling half-UAB can be
* tied together.
* 
* @param refTied
* @arg 0 references not shared
* @arg 1 references shared
*
* @note Make sure that one of the reference buffers is disabled before tying them
* together.
*
* @internal
* @reglist @reg ADC_1_UABH_B_OA1_CTRL
* @image html _.png 
* @endinternal
* 
* 
* @see ADC_1_UABH_B_SetAgndTied()
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetRefTied( CyUAB_ref_tied_enum refTied)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_REF_TIED_PTR, 
      ADC_1_UABH_B_REF_TIED_MASK, 
      ((uint32)refTied), 
      ADC_1_UABH_B_REF_TIED_SHIFT
    );
}

/*********** ADC_1_UABH_B_SetAgndTied() ***********************************/
/*!
* @brief Ties the outputs of the analog-ground buffers of the two UAB-halves
* together.
* 
* @details The analog-ground buffers of this half-UAB and its sibling half-UAB can
* be tied together.
*
* @param agndTied
* @arg 0 references not shared
* @arg 1 references shared
*
* @note Make sure that one of the analog-ground buffers is disabled before tying
* them together.
* 
* @internal
* @reglist @reg ADC_1_UABH_B_OA0_CTRL
* @image html _.png 
* @endinternal
* 
* @see ADC_1_UABH_B_SetRefTied()
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetAgndTied(CyUAB_agnd_tied_enum agndTied)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_AGND_TIED_PTR, 
      ADC_1_UABH_B_AGND_TIED_MASK, 
      ((uint32)agndTied), 
      ADC_1_UABH_B_AGND_TIED_SHIFT
    );
}


/*Caps*/

/***************** ADC_1_UABH_B_SetCapA() *********************************/
/*!
* @brief Set the capacitance for branch A
* 
* @details There are three input branches (A, B, C) and a single feedback branch (F).  
* Each branch can have its capacitance configured independently.
* 
* The A, B, and C branches have capacitance range of 0-63 units (0-3150fF) in increments of 50fF.  
* The F branch has a capacitance range of 0-64 units (0-3200fF) in increments of 100fF.
*
* @note In branches B and C, there are attenuation capacitors in the signal path.
* This function does not configure those capacitors.
* @see ADC_1_UABH_B_SetAttenBypassSwitchB()
* @see ADC_1_UABH_B_SetAttenBypassSwitchC()
*
* @see ADC_1_UABH_B_SetCaps()
* @see ADC_1_UABH_B_SetCapB()
* @see ADC_1_UABH_B_SetCapC()
* @see ADC_1_UABH_B_SetCapF()
*
* @internal
* @reglist @reg ADC_1_UABH_B_CAP_ABCF0_VAL @reg ADC_1_UABH_B_CAP_ABCF1_VAL
* @image html SetCapacitors.png 
* @endinternal
*
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetCapA(CyUAB_cap_enum capA)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_CAP_ABCF_VAL_PTR,
      ADC_1_UABH_B_CA_VAL_MASK, 
      ((uint32)capA), 
      ADC_1_UABH_B_CA_VAL_SHIFT
    );
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_CAP_AB_VAL_NXT_PTR, 
      ADC_1_UABH_B_CA_VAL_MASK, 
      ((uint32)capA), 
      ADC_1_UABH_B_CA_VAL_SHIFT
    ); 
}

/***************** ADC_1_UABH_B_SetCapB() *********************************/
/*!
* @brief Set the capacitance for branch B
* 
* @details There are three input branches (A, B, C) and a single feedback branch (F).  
* Each branch can have its capacitance configured independently.
* 
* The A, B, and C branches have capacitance range of 0-63 units (0-3150fF) in increments of 50fF.  
* The F branch has a capacitance range of 0-64 units (0-3200fF) in increments of 100fF.
*
* @note In branches B and C, there are attenuation capacitors in the signal path.
* This function does not configure those capacitors.
* @see ADC_1_UABH_B_SetAttenBypassSwitchB()
* @see ADC_1_UABH_B_SetAttenBypassSwitchC()
*
* @see ADC_1_UABH_B_SetCaps()
* @see ADC_1_UABH_B_SetCapA()
* @see ADC_1_UABH_B_SetCapC()
* @see ADC_1_UABH_B_SetCapF()
* @see ADC_1_UABH_B_SetGroundUnused()
*
* @internal
* @reglist @reg ADC_1_UABH_B_CAP_ABCF0_VAL @reg ADC_1_UABH_B_CAP_ABCF1_VAL
* @image html SetCapacitors.png 
* @endinternal
* 
* @sideeffect capB[5:0] = capB[6] ? 0x3F : capB[5:0]
*******************************************************************************/
void ADC_1_UABH_B_SetCapB(CyUAB_b_cap_enum capB)
{
    const uint32 threshold64 = 64UL; /*capB>=64 are treated the same (set CB_64 and CB_VAL[5:0]==0x3F) */
    const uint32 b64 = ADC_1_UABH_B_CB_64_MASK | ADC_1_UABH_B_CB_VAL_MASK;
    uint32 bval = (((uint32)capB)>=threshold64) ? b64 : ((uint32)capB);
    ADC_1_UABH_B_SET_VARIOUS_FIELDS(
      ADC_1_UABH_B_CAP_ABCF_VAL_PTR,
      ADC_1_UABH_B_CB_64_MASK | ADC_1_UABH_B_CB_VAL_MASK, 
       bval
    );
    
    /*No CB_64 in CAP_AB_VAL_NXT register*/
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_CAP_AB_VAL_NXT_PTR, 
      ADC_1_UABH_B_CB_VAL_MASK, 
      bval,
      ADC_1_UABH_B_CB_VAL_SHIFT
    );
}

/***************** ADC_1_UABH_B_SetCapC() *********************************/
/*!
* @brief Set the capacitance for branch C
* 
* @details There are three input branches (A, B, C) and a single feedback branch (F).  
* Each branch can have its capacitance configured independently.
* 
* The A, B, and C branches have capacitance range of 0-63 units (0-3150fF) in increments of 50fF.  
* The F branch has a capacitance range of 0-64 units (0-3200fF) in increments of 100fF.
*
* @note In branches B and C, there are attenuation capacitors in the signal path.
* This function does not configure those capacitors.
* @see ADC_1_UABH_B_SetAttenBypassSwitchB()
* @see ADC_1_UABH_B_SetAttenBypassSwitchC()
* 
* @see ADC_1_UABH_B_SetCaps()
* @see ADC_1_UABH_B_SetCapA()
* @see ADC_1_UABH_B_SetCapB()
* @see ADC_1_UABH_B_SetCapF()
* @see ADC_1_UABH_B_SetGroundUnused()
*
* @internal
* @reglist @reg ADC_1_UABH_B_CAP_ABCF0_VAL @reg ADC_1_UABH_B_CAP_ABCF1_VAL
* @image html SetCapacitors.png 
* @endinternal
*
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetCapC(CyUAB_cap_enum capC)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_CAP_ABCF_VAL_PTR,
      ADC_1_UABH_B_CC_VAL_MASK, 
      ((uint32)capC), 
      ADC_1_UABH_B_CC_VAL_SHIFT
    );
    /*Not setting CC_VAL_UPDATE bit*/
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_CAP_CF_VAL_NXT_PTR, 
      ADC_1_UABH_B_CC_VAL_MASK, 
      ((uint32)capC), 
      ADC_1_UABH_B_CC_VAL_SHIFT
    );
}

/***************** ADC_1_UABH_B_SetCapF() *********************************/
/*!
* @brief Set the capacitance for branch F
* 
* @details There are three input branches (A, B, C) and a single feedback branch (F).  
* Each branch can have its capacitance configured independently.
* 
* The A, B, and C branches have capacitance range of 0-63 units (0-3150fF) in increments of 50fF.  
* The F branch has a capacitance range of 0-64 units (0-3200fF) in increments of 100fF.
*
* @note In branches B and C, there are attenuation capacitors in the signal path.
* This function does not configure those capacitors.
* @see ADC_1_UABH_B_SetAttenBypassSwitchB()
* @see ADC_1_UABH_B_SetAttenBypassSwitchC()
*
* @see ADC_1_UABH_B_SetCaps()
* @see ADC_1_UABH_B_SetCapA()
* @see ADC_1_UABH_B_SetCapB()
* @see ADC_1_UABH_B_SetCapC()
*
* @internal
* @reglist @reg ADC_1_UABH_B_CAP_ABCF0_VAL @reg ADC_1_UABH_B_CAP_ABCF1_VAL
* @image html SetCapacitors.png 
* @endinternal
*
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetCapF(CyUAB_f_cap_enum capF)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_CAP_ABCF_VAL_PTR,
      ADC_1_UABH_B_CF_VAL_MASK, 
      ((uint32)capF), 
      ADC_1_UABH_B_CF_VAL_SHIFT
    );
    /*Not setting CF_VAL_UPDATE bit*/
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_CAP_CF_VAL_NXT_PTR, 
      ADC_1_UABH_B_CF_VAL_MASK, 
      ((uint32)capF), 
      ADC_1_UABH_B_CF_VAL_SHIFT
    );    
}

