uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1_UABH_B.c
/***************** ADC_1_UABH_B_SetCaps() *********************************/
/*!
* @brief Set the capacitances individually for all branches (A,B,C,F)
* 
* @details There are three input branches (A, B, C) and a single feedback branch (F).  
* Each branch can have its capacitance configured independently.
* 
* The A, B, and C branches have capacitance range of 0-63 units (0-3150fF) in increments of 50fF.  
* The F branch has a capacitance range of 0-64 units (0-3200fF) in increments of 100fF.

* @note In branches B and C, there are attenuation capacitors in the signal path.
* This function does not configure those capacitors.  See ADC_1_UABH_B_SetAttenuationTrim() 
* and ADC_1_UABH_B_SetAttenBypassSwitch().
* 
* @param capA Use the CyUAB_cap_enum enumerated values.
* @param capB Use the CyUAB_b_cap_enum enumerated values.
* @param capC Use the CyUAB_cap_enum enumerated values.
* @param capF Use the CyUAB_f_cap_enum enumerated values.
*
* @see ADC_1_UABH_B_SetCapA()
* @see ADC_1_UABH_B_SetCapC()
* @see ADC_1_UABH_B_SetCapF()
* @see ADC_1_UABH_B_SetGroundUnused()
* @see ADC_1_UABH_B_SetSwitch(CyUAB_SW_TB,clk)
* @see ADC_1_UABH_B_SetSwitch(CyUAB_SW_TC,clk)
* 
* @internal
* @reglist @reg ADC_1_UABH_B_CAP_ABCF0_VAL @reg ADC_1_UABH_B_CAP_ABCF1_VAL
* @image html _.png 
* @endinternal
*
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetCaps(CyUAB_cap_enum capA, CyUAB_b_cap_enum capB, 
    CyUAB_cap_enum capC, CyUAB_f_cap_enum capF)
{
    ADC_1_UABH_B_SetCapA(capA);
    ADC_1_UABH_B_SetCapB(capB);
    ADC_1_UABH_B_SetCapC(capC);
    ADC_1_UABH_B_SetCapF(capF);
}

/********* ADC_1_UABH_B_SetGroundUnused() *********************************/
/*!
* @brief Sets whether unused capacitors are grounded or floating.
* 
* @details By default unused caps in the cap array are left floating.  
* Unused caps in branch B and C can be grounded when not in use.  
*
* When used as a DAC, the UAB uses two branches, one for MSBs, one for LSBs.
* The MSB cap array unit cells have their bottom plate floated when the
* CAP is not being used. For the LSB array, the unused caps must be shorted to the
* Analog Ground. Most common case will be using Branch A as MSB, with one of
* either B/C as the LSB.  Returns @c void.
*
* @param gndUnusedB ground unused caps in branch B
* @param gndUnusedC gournd unused caps in branch C
*
* @internal
* @reglist @reg ADC_1_UABH_B_CAP_CTRL0 ADC_1_UABH_B_CAP_CTRL1
* @image html SetCapacitors.png 
* @endinternal
*
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetGroundUnused(CyUAB_gnd_unused_enum gndUnusedB, CyUAB_gnd_unused_enum gndUnusedC )
{
    
    /*mask input values before shifting to prevent overlap*/
    const uint32 CB_GND_PRESHIFT_MASK = ADC_1_UABH_B_CB_GND_MASK>>ADC_1_UABH_B_CB_GND_SHIFT;
    const uint32 CC_GND_PRESHIFT_MASK = ADC_1_UABH_B_CC_GND_MASK>>ADC_1_UABH_B_CC_GND_SHIFT;
    const uint32 mask = ADC_1_UABH_B_CC_GND_MASK | ADC_1_UABH_B_CB_GND_MASK;
    ADC_1_UABH_B_SET_VARIOUS_FIELDS(
      ADC_1_UABH_B_CAP_CTRL_PTR,
      mask,
      ((uint32)( 
        ( ( ((uint32)gndUnusedC) & CC_GND_PRESHIFT_MASK) <<ADC_1_UABH_B_CC_GND_SHIFT ) |
        ( ( ((uint32)gndUnusedB) & CB_GND_PRESHIFT_MASK) <<ADC_1_UABH_B_CB_GND_SHIFT )
      ))
    );
}



/*DAC*/

/******************* ADC_1_UABH_B_SetDacModeEn() **************************/
/*!
* @brief DACMODE_EN effects how the sign bit of DAC data is used as modbit.
* 
* @details If the UAB is set to a DAC_MODE, then the SIGN_VAL bit is used as part
* of the DAC number.  The entire data word is decoded according to the DAC_MODE.
* If the UAB is not in a DAC_MODE, the SIGN_VAL bit is not computed when determining
* how to decode the data in the capacitor registers.  In either case, the modbit_src
* must be set to the firmware choice.
*
* @param isEnabled enable DAC mode
*
* @see ADC_1_UABH_B_SetDacMode()
* @see ADC_1_UABH_B_SetModbitSource()
*
* @internal
* @reglist @reg ADC_1_UABH_B_CAP_CTRL_REG
* @endinternal
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetDacModeEn(CyUAB_dac_mode_en_enum isEnabled)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_CAP_CTRL_PTR, 
      ADC_1_UABH_B_DAC_MODE_EN_MASK, 
      ((uint32)isEnabled), 
      ADC_1_UABH_B_DAC_MODE_EN_SHIFT
    );
}

/*************** ADC_1_UABH_B_SetDacMode() ********************************/
/*!
* @brief Sets the DAC mode.
* 
* @details The DAC can be operated as a 12-bit unsigned, 12-bit virtual signed, 
* or 13-bit unsigned DAC.  This function sets that mode.
* 
* @param dacMode DAC mode selection
*
* @see ADC_1_UABH_B_SetDacModeEn()
* @see ADC_1_UABH_B_SetModbitSource()
*
* @internal
* @reglist @reg ADC_1_UABH_B_CAP_CTRL_REG
* @endinternal
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetDacMode(CyUAB_dac_mode_enum dacMode)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_CAP_CTRL_PTR, 
      ADC_1_UABH_B_DAC_MODE_MASK, 
      ((uint32)dacMode), 
      ADC_1_UABH_B_DAC_MODE_SHIFT
    );    
}

/*************** ADC_1_UABH_B_SetDacNext() ********************************/
/*!
* @brief Set the next value to be converted by the DAC.
* 
* @details To make sure that the DAC loads its values at the right time, there
* is a register used as a digital buffer.  This function loads that buffer,
* which gets transferred to the capacitors during the next @c strobe signal.
* 
* @param nextDACVal buffered DAC value
*
* @see ADC_1_UABH_B_SetDacModeEn()
* @see ADC_1_UABH_B_SetDacMode()
* @see ADC_1_UABH_B_SetModbitSource()
*
* @internal
* @reglist @reg ADC_1_UABH_B_CAP_AB_VAL_NXT_REG.
* This function is @b NOT generalized.  It depends on the 'next' values all
* being contiguous within a single register.
* @endinternal
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetDacNext(int16 nextDACVal)
{
    /*Uses a custom mask because the operation writes over three bitfields. 
    The shift amount is the shift amount for the field that represents the LSBs*/
    
    uint32 val = ( ((uint32)nextDACVal) & ((uint32)ADC_1_UABH_B_DAC_NEXT_MASK) );
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_CAP_AB_VAL_NXT_PTR, 
      ADC_1_UABH_B_DAC_NEXT_MASK, 
      val, 
      ADC_1_UABH_B_CB_VAL_SHIFT
    );
}

/*PGA*/

