uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1_UABH_B.c
/************** ADC_1_UABH_B_SetCapCFNext() *******************************/
/*!
* @brief Set the next value to be loaded into branch C and branch F capacitors.
* 
* @details To make sure that the C/F cap arrays are double-buffered, there
* is a register used as a digital buffer.  This function loads that buffer,
* which gets transferred to the capacitors during the next @c strobe signal.
* 
* @param nextCapC buffered C capacitance
* @param nextCapF buffered F capacitance
*
* @internal
* @reglist @reg ADC_1_UABH_B_CAP_CF_VAL_NXT_REG.
* This function is @b NOT generalized.  It depends on the 'next' values all
* being contiguous within a single register.
* @endinternal
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetCapCFNext(CyUAB_cap_enum nextCapC,CyUAB_f_cap_enum nextCapF)
{
    const uint32 CF_VAL_PRESHIFT_MASK = ((uint32)(ADC_1_UABH_B_CF_VAL_MASK>>ADC_1_UABH_B_CF_VAL_SHIFT));
    const uint32 CC_VAL_PRESHIFT_MASK = ((uint32)(ADC_1_UABH_B_CC_VAL_MASK>>ADC_1_UABH_B_CC_VAL_SHIFT));
    const uint32 mask = ((uint32)ADC_1_UABH_B_CF_VAL_UPDATE_MASK) | ((uint32)ADC_1_UABH_B_CC_VAL_UPDATE_MASK) |
      ((uint32)ADC_1_UABH_B_CF_VAL_MASK) | ((uint32)ADC_1_UABH_B_CC_VAL_MASK);
    
    /* Also setting CF_VAL_UPDATE and CC_VAL_UPDATE bits */
    ADC_1_UABH_B_SET_VARIOUS_FIELDS(
      ADC_1_UABH_B_CAP_CF_VAL_NXT_PTR,
      mask,
      ((uint32)ADC_1_UABH_B_CF_VAL_UPDATE_MASK) | ((uint32)ADC_1_UABH_B_CC_VAL_UPDATE_MASK) |
        ( ( ((uint32)nextCapF) & CF_VAL_PRESHIFT_MASK)<<ADC_1_UABH_B_CF_VAL_SHIFT ) |
        ( ( ((uint32)nextCapC) & CC_VAL_PRESHIFT_MASK)<<ADC_1_UABH_B_CC_VAL_SHIFT ) 
	);
}


/* Comparator */

/*************** ADC_1_UABH_B_SetCompEdgeDetect() *************************/
/*!
* @brief Set what level of comparator activity to use to generate interrupt and
* trigger-output.
* 
* @details The comparator can be used as the source for an interrupt and/or a 
* trigger-output.  This function configures whether an interrupt is triggered, 
* and if so, whether to trigger on the comparator's rising edge, falling edge, 
* or both.  Returns @c void.
* 
* @param detectMode interrupt and trigger output comparator edge selection
*
* @internal
* @reglist @reg ADC_1_UABH_B_OA0_CTRL_REG ADC_1_UABH_B_OA1_CTRL_REG
* @endinternal
* 
* 
* @see ADC_1_UABH_B_SetCompOutLevel()
* @see ADC_1_UABH_B_GetCompStatus()
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetCompEdgeDetect(CyUAB_cmp_edge_enum detectMode)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_OA_CTRL_PTR, 
      ADC_1_UABH_B_CMP_EDGE_MASK, 
      ((uint32)detectMode), 
      ADC_1_UABH_B_CMP_EDGE_SHIFT
    );
}

/************ ADC_1_UABH_B_SetCompOutLevel ********************************/
/*!
* @brief Sets the comparator output trigger level.
* 
* @details
* 
* @internal
* @reglist @reg ADC_1_UABH_B_OA0_CTRL_REG
* @endinternal
* 
* @param isLevel
*   @arg @c 0 - Output trigger will be a pulse.
*   @arg @c 1 - Output trigger will be level.
*
* @see ADC_1_UABH_B_SetCompEdgeDetect()
* 
* @see ADC_1_UABH_B_GetCompStatus()
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetCompOutLevel(CyUAB_cmp_level_enum isLevel)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_OA_CTRL_PTR, 
      ADC_1_UABH_B_CMP_DSI_LEVEL_MASK, 
      ((uint32)isLevel), 
      ADC_1_UABH_B_CMP_DSI_LEVEL_SHIFT
    );
}


/************  ADC_1_UABH_B_GetCompStatus() *******************************/
/*!
* @brief Get the output status of the Comparator.
* 
* @details Show the current comparator status output. Return type is @c uint8 an 
* unsigned 8-bit integer. It returns 1 if the current comp output is HIGH, and 
* returns 0 if current comp output is LOW
* 
* @internal
* @reglist @reg STAT0 STAT1
* @endinternal
* 
* @see ADC_1_UABH_B_SetCompEdgeDetect()
* @see ADC_1_UABH_B_SetCompOutLevel()
* 
* 
* @sideeffect None
*******************************************************************************/
uint32 ADC_1_UABH_B_GetCompStatus(void)
{
    /*GET_FIELD() has an addional shift*/
    uint32 r = (0UL != ((*(ADC_1_UABH_B_STAT_PTR)) & ADC_1_UABH_B_COMP_MASK)) ? 1UL : 0UL;
    return r;    
}


/* Switches */


/************** ADC_1_UABH_B_SetEarly() ***********************************/
/*!
* @brief Set early clock timing for specific switches
* 
* @details Applies to PS (OUT<->SUM) and PO (VOUT->OUT) switches only.
*
* @param sw_id CyUAB_SW_PS or CyUAB_SW_PO - ignores all other values of id
* @param isEarly 
* @arg CyUAB_CLK_ADJ_NOEARLY normal timing
* @arg CyUAB_CLK_ADJ_EARLY   early timing
*
* @internal
* @reglist @reg ADC_1_UABH_B_SW_STATIC0_REG or ADC_1_UABH_B_SW_STATIC1_REG
* @image html _.png 
* @endinternal
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetEarly(CyUAB_sw_id_enum sw_id, CyUAB_clk_adj_enum isEarly)
{
    if( CyUAB_SW_PS==sw_id )
    {
        ADC_1_UABH_B_SET_FIELD(
          ADC_1_UABH_B_SW_STATIC_PTR, 
          ADC_1_UABH_B_EARLY_PS_MASK, 
          ((uint32)isEarly), 
          ADC_1_UABH_B_EARLY_PS_SHIFT
        ); 
    }
    else if( CyUAB_SW_PO==sw_id )
    {
        ADC_1_UABH_B_SET_FIELD(
          ADC_1_UABH_B_SW_STATIC_PTR, 
          ADC_1_UABH_B_EARLY_PO_MASK, 
          ((uint32)isEarly), 
          ADC_1_UABH_B_EARLY_PO_SHIFT
        );
    }
    else
    {
        /* do nothing - only 2 switches have early option */   
    }
}



/* Clocking */




/************** ADC_1_UABH_B_Run() ****************************************/
/*!
* @brief UAB clock enabling
* 
* @details sets and clears RUN bit
* The UAB clocks are not enabled by default.  Once they are enabled,
* they will either wait for a trigger (see ADC_1_UABH_B_SetInputTrigger()),
* or start immediately.
*
* Can call this immediately after calling Enable() (setting ENABLED bit) - 
* no delay required - run bit control logic handles UAB ramp up
*
* @param flag
* @arg 0 clear run bit
* @arg 1 set run bit
*
* @internal
* @reglist @reg SRAM0_CTRL @reg SRAM1_CTRL
* @image html _.png 
* @endinternal
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_Run(uint32 flag)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_SRAM_CTRL_PTR,
      ADC_1_UABH_B_RUN_MASK, 
      flag, 
      ADC_1_UABH_B_RUN_SHIFT
    );    
}


