uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1_UABH_B.c
/************** ADC_1_UABH_B_SetLastStep() ********************************/
/*!
* @brief Configure UAB-half clock width
* 
* @details The clocks can be up to 16 steps wide.  They can be configured to
* use any or all of the 16 step.  This function sets how many of the steps are
* to be used.  This width applies to all 12 clocks.  Returns @c void.
* 
* @internal
* @reglist @reg ADC_1_UABH_B_SRAM0_CTRL_REG
* @endinternal
* 
* @param lastStep The last step desired to be used from SRAM clocks.
* Should be between @c 0 and @c 15 inclusive.
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetLastStep(uint32 lastStep)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_SRAM_CTRL_PTR, 
      ADC_1_UABH_B_LAST_STEP_MASK,
      lastStep, 
      ADC_1_UABH_B_LAST_STEP_SHIFT
    );    
}

/******** ADC_1_UABH_B_SetStartupDelay() **********************************/
/*!
* @brief Set the delay time before UAB starts running.
* 
* @details After a positive edge on the Trigger it will take STARTUP_DELAY clk half 
* cycles before the first UAB clock happens. This allows firmware to precisely align 
* the UAB output with the SAR schedule. Returns @c void.
* 
* @internal
* @reglist @reg ADC_1_UABH_B_STARTUP_DELAY0_REG
* @endinternal
* 
* @param delayCount The number of clock cycles to delay before starting the UAB clocks. 
* A value of 0 disables this function.
* 
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetStartupDelay(uint16 delayCount)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_STARTUP_DELAY_PTR, 
      ADC_1_UABH_B_STARTUP_DELAY_MASK, 
      (uint32)delayCount, 
      ADC_1_UABH_B_STARTUP_DELAY_SHIFT
    );
}

/*********** ADC_1_UABH_B_SetAlignMode() **********************************/
/*!
* @brief Change meaning of startupDelay based on scheduled or unscheduled mode
* 
* @details 
*
* @internal
* @reglist @reg ADC_1_UABH_B_STARTUP_DELAY0_REG , ADC_1_UABH_B_STARTUP_DELAY1_REG
* @endinternal
*
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetAlignMode(CyUAB_align_mode_enum alignMode)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_STARTUP_DELAY_PTR, 
      ADC_1_UABH_B_ALIGN_MODE_MASK, 
      ((uint32)alignMode), 
      ADC_1_UABH_B_ALIGN_MODE_SHIFT
    );
}


/******** ADC_1_UABH_B_SetSubsample() *************************************/
/*!
* @brief Set the sub-sample waveform for selecting VALID signal.
* 
* @details Suppress VALID signal during the first subSampNum analog clock
* periods. Only allow VALID output in the last of the subSampNum+1 analog clock
* periods. Returns @c void.
* 
* @internal
* @reglist @reg SUBSAMPLE_CTRL0 @reg SUBSAMPLE_CTRL1
* @endinternal
* 
* @param subsample The VALID signal will be suppressed this many times.  
* A value of 0 will not suppress the VALID signal.
* 
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetSubsample(uint8 subsample)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_SUBSAMPLE_CTRL_PTR, 
      ADC_1_UABH_B_SUBSAMPLE_MASK, 
      ((uint32)subsample), 
      ADC_1_UABH_B_SUBSAMPLE_SHIFT
    );
}

/***************  ADC_1_UABH_B_SetSubsampleInit() *************************/
/*!
* @brief Set the subsampling counter value.
* 
* @details Initial value of the subsampling down counter. Before this UAB half is
* running the firmware can write to this field the initial value of the subsample
* down counter. It is recommended that the following is true for the initial value
* SUBSAMPLE_INIT <= SUBSAMPLE, however this is not a requirement. Writing a bigger
* value can be used to postpone the very first Valid output. Returns @c void.
* 
* @internal
* @reglist @reg SUBSAMPLE_CTRL0 @reg SUBSAMPLE_CTRL1
* @endinternal
* 
* @param subsampleInit: The initial value for the subsampling counter.
*
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetSubsampleInit(uint8 subsampleInit)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_SUBSAMPLE_CTRL_PTR, 
      ADC_1_UABH_B_SUBSAMPLE_INIT_MASK, 
      ((uint32)subsampleInit), 
      ADC_1_UABH_B_SUBSAMPLE_INIT_SHIFT
    );
}


/************* ADC_1_UABH_B_GetCurrentSubsample() *************************/
/*!
* @brief Get currSubsample
* 
* @details
*
*
* @internal
* @reglist @reg STAT0.CURR_SUBSAMPLE @reg STAT1.CURR_SUBSAMPLE
* @image html _.png 
* @endinternal
* 
* @sideeffect None
*******************************************************************************/
uint32 ADC_1_UABH_B_GetCurrentSubsample(void)
{
    return ADC_1_UABH_B_GET_FIELD(
      ADC_1_UABH_B_STAT_PTR,
      ADC_1_UABH_B_CURR_SUBSAMPLE_MASK,
      ADC_1_UABH_B_CURR_SUBSAMPLE_SHIFT
    );
}

/************** ADC_1_UABH_B_GetCurrentStep() *****************************/
/*!
* @brief Get currStep
* 
* @details
*
*
* @internal
* @reglist @reg STAT0.CURR_STEP @reg STAT1.CURR_STEP
* @image html _.png 
* @endinternal
* 
* @sideeffect None
*******************************************************************************/
uint32 ADC_1_UABH_B_GetCurrentStep(void)
{
    return ADC_1_UABH_B_GET_FIELD(
      ADC_1_UABH_B_STAT_PTR,
      ADC_1_UABH_B_CURR_STEP_MASK,
      ADC_1_UABH_B_CURR_STEP_SHIFT
    );
}


/**************** ADC_1_UABH_B_SetModbitSource() **************************/
/*!
* @brief Select source of switch control (modbit).
* 
* @details 4 of UAB clocks can use a modbit signal. This function selects the 
* source of the modbit.
* 
* @internal
* @reglist @reg ADC_1_UABH_B_SW_MODBIT_SRC0 , ADC_1_UABH_B_SW_MODBIT_SRC1
* @endinternal
* 
* @param modbitSrcAB branch A and branch B modbit selection
* @param modbitSrcC  branch C modbit selection valid choices are:
* @arg    0    = UAB0 half 0 comparator output
* @arg    1    = UAB0 half 1 comparator output
* @arg    2    = UAB1 half 0 comparator output
* @arg    3    = UAB1 half 1 comparator output
* @arg    4    = UAB2 half 0 comparator output
* @arg    5    = UAB2 half 1 comparator output
* @arg    6    = UAB3 half 0 comparator output
* @arg    7    = UAB3 half 1 comparator output
* @arg    8-30 = generic trigger inputs 0-22
* @arg    31   = SIGN_VAL , also used as Firmware modbit. 
* (In VDAC use-case this inverts the voltage on the A and B Caps). 
* @param modbitSrcC  branch C modbit selection valid choices are:
* @arg    0    = UAB0 half 0 comparator output
* @arg    1    = UAB0 half 1 comparator output
* @arg    2    = UAB1 half 0 comparator output
* @arg    3    = UAB1 half 1 comparator output
* @arg    4    = UAB2 half 0 comparator output
* @arg    5    = UAB2 half 1 comparator output
* @arg    6    = UAB3 half 0 comparator output
* @arg    7    = UAB3 half 1 comparator output
* @arg    8-30 = generic trigger inputs 0-22
* @arg    31   = SIGN_VAL , also used as Firmware modbit.
* For PSoC4400, only values 0-1, 8-13, and 31 are valid.
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetModbitSource( uint32 modbitSrcAB, uint32 modbitSrcC )
{
    /*mask input values before shifting to prevent overlap*/
    const uint32 MODBIT_SRC_AB_PRESHIFT_MASK = ADC_1_UABH_B_MODBIT0_SRC_SEL_MASK>>ADC_1_UABH_B_MODBIT0_SRC_SEL_SHIFT;
    const uint32 MODBIT_SRC_C_PRESHIFT_MASK = ADC_1_UABH_B_MODBIT1_SRC_SEL_MASK>>ADC_1_UABH_B_MODBIT1_SRC_SEL_SHIFT;
    ADC_1_UABH_B_SET_VARIOUS_FIELDS(
      ADC_1_UABH_B_SW_MODBIT_SRC_PTR,
      ADC_1_UABH_B_MODBIT1_SRC_SEL_MASK | ADC_1_UABH_B_MODBIT0_SRC_SEL_MASK,
      (uint32)( 
        ( (modbitSrcAB & MODBIT_SRC_AB_PRESHIFT_MASK) <<ADC_1_UABH_B_MODBIT0_SRC_SEL_SHIFT ) | 
        ( (modbitSrcC &MODBIT_SRC_C_PRESHIFT_MASK) <<ADC_1_UABH_B_MODBIT1_SRC_SEL_SHIFT ) 
      )
    );    
}


