uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1_UABH_B.c
/********************** ADC_1_UABH_B_SetStrobeMode ************************/
/*!
* @brief Configure whether strobe is used to load next capacitor values or 
* discharge them.
* 
* @details The strobe signal is used to time when to load the “next” value
* (in the case of DAC usage) or to discharge the capacitors (in the case of DelSig
* usage).  This function chooses which of those options the strobe is used for.
* 
* @internal
* @reglist @reg SW_STATIC0 @reg SW_STATIC1
* @endinternal
* 
* @param strobeMode
*   @arg @c 0 - Strobe will be used to load next capacitor values (for DAC)
*   @arg @c 1 - Strobe will be used to discharge capacitors
* 
* @see
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetStrobeMode(CyUAB_strobe_mode_enum strobeMode)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_SW_STATIC_PTR, 
      ADC_1_UABH_B_STRB_RST_EN_MASK, 
      ((uint32)strobeMode), 
      ADC_1_UABH_B_STRB_RST_EN_SHIFT
    );
}

/*********** ADC_1_UABH_B_SetStrobeSource *********************************/
/*!
@brief Select the trigger source that is logically ANDed with STROBE_RST waveform source.  

@details Normally, the positive edge of the STROBE_RST waveform is used to 
synchronize the time when to load the "next" caps value (in the case of DAC usage) 
or to discharge the capacitors (in the case of DelSig usage). 
When STROBE_RST is a modbitted waveform, the trigger source selected by this function 
must also be asserted. 
Returns @c void.

@internal
@reglist @reg ADC_1_UABH_B_SW_STATIC0_REG.STRB_RST0_SEL or ADC_1_UABH_B_SW_STATIC1_REG.STRB_RST1_SEL
@endinternal

@param strobeSource
* @arg    0    = UAB0 half 0 comparator output
* @arg    1    = UAB0 half 1 comparator output
* @arg    2    = UAB1 half 0 comparator output
* @arg    3    = UAB1 half 1 comparator output
* @arg    4    = UAB2 half 0 comparator output
* @arg    5    = UAB2 half 1 comparator output
* @arg    6    = UAB3 half 0 comparator output
* @arg    7    = UAB3 half 1 comparator output
* @arg    8-31 = generic trigger inputs 0-23
*
* For PSoC4400, only values 0-1 and 8-13 are valid.
*
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetStrobeSource(uint32 strobeSource)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_SW_STATIC_PTR, 
      ADC_1_UABH_B_STRB_RST_SEL_MASK, 
      strobeSource, 
      ADC_1_UABH_B_STRB_RST_SEL_SHIFT
    );
}


/************ ADC_1_UABH_B_SetFirmwareModbit() ****************************/
/*!
* @brief Set the firmware modbit.
* 
* @details This function sets the firmware modbit. The modbit affects several 
* clocks.  If firmware modbit is selected (Use ADC_1_UABH_B_SetModbitSource() choice 31),
* this value will be used.  
* 
* @see ADC_1_UABH_B_SetModbitSource()
*
* @internal
* @reglist @reg CAP_AB0_VAL_NXT_REG.SIGN0_VAL @reg CAP_AB1_VAL_NXT_REG.SIGN0_VAL
* @endinternal
*
* 
* @sideeffect The firmware modbit is also used as a "sign bit" by the
* DAC.
*******************************************************************************/
void ADC_1_UABH_B_SetFirmwareModbit(uint32 flag)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_CAP_ABCF_VAL_PTR, 
      ADC_1_UABH_B_SIGN_VAL_MASK,
      (uint32)flag, 
      ADC_1_UABH_B_SIGN_VAL_SHIFT
    );
}


/************* ADC_1_UABH_B_SetInputTrigger() *****************************/
/*!
* @brief Configure UAB-half clock starting trigger.
* 
* @details The clocks can be configured to start running when a trigger signal 
* is received.  This function chooses whether to use the trigger, and if so, 
* which trigger to use.  Trigger state is irrelevant if ADC_1_UABH_B_EnableClocks()
* has not been called.
* 
* @internal
* @reglist @reg ADC_1_UABH_B_SRAM0_CTRL_REG ADC_1_UABH_B_SRAM1_CTRL_REG
* @endinternal
* 
* @param triggerEn Enables the input trigger.  If 0, trigger signal is ignored,
* and the SRAM clocks will start running as soon as the ADC_1_UABH_B_EnableClocks()
* is invoked.  If not 0, the SRAM clocks will start running when the trigger
* signal is received.
* @param triggerSel Choice for trigger signal. Valid inputs are:
* @arg    0    = UAB0 half 0 trigger output
* @arg    1    = UAB0 half 1 trigger output
* @arg    2    = UAB1 half 0 trigger output
* @arg    3    = UAB1 half 1 trigger output
* @arg    4    = UAB2 half 0 trigger output
* @arg    5    = UAB2 half 1 trigger output
* @arg    6    = UAB3 half 0 trigger output
* @arg    7    = UAB3 half 1 trigger output
* @arg    8-30 = generic trigger inputs 0-22
* @arg    31   = SAR trigger output
*
* For PSoC4400, only values 0-1, 8-13, and 31 are valid.
*
* @see ADC_1_UABH_B_EnableClocks()
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetInputTrigger(uint32 triggerEn, uint32 triggerSel)
{
    /*mask input values before shifting to prevent overlap*/
    const uint32 TRIG_SEL_PRESHIFT_MASK = ADC_1_UABH_B_TRIG_SEL_MASK>>ADC_1_UABH_B_TRIG_SEL_SHIFT;
    const uint32 TRIGGER_EN_PRESHIFT_MASK = ADC_1_UABH_B_TRIGGER_EN_MASK>>ADC_1_UABH_B_TRIGGER_EN_SHIFT;
    ADC_1_UABH_B_SET_VARIOUS_FIELDS(
      ADC_1_UABH_B_SRAM_CTRL_PTR,
      ADC_1_UABH_B_TRIG_SEL_MASK | ADC_1_UABH_B_TRIGGER_EN_MASK,
      ( (triggerSel & TRIG_SEL_PRESHIFT_MASK) <<ADC_1_UABH_B_TRIG_SEL_SHIFT   ) | 
      ( (triggerEn & TRIGGER_EN_PRESHIFT_MASK) <<ADC_1_UABH_B_TRIGGER_EN_SHIFT )
    );
}


/****************** ADC_1_UABH_B_SetStaticSwitch() ************************/
/*!
* @brief Consistent interface for configuring static switches.
* 
* @details 
* Unpacks @p sw_id to get switch control field location (register offset and field 
* shift value) and sets that location to @p clk 
*
* @param sw_id represents a switch encoded with its reg field location
* @param clk switch setting (enum converted to single static switch bit field)
* CyUAB_SW_OPEN: open switch 
* CyUAB_SW_CLOSED and all other non-zero values: close switch 
*
* @note The exception is the two agnd and ref buffer sharing switches - 
* they are set through a different interface.
* 
* @internal
* @reglist @reg MANY
* @image html test123.png 
* @endinternal
* 
* @sideeffect None
*******************************************************************************/
void ADC_1_UABH_B_SetStaticSwitch(CyUAB_sw_id_enum sw_id, CyUAB_clk_enum clk)
{   
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_GetStaticSwAddr( (sw_id) ), 
      ADC_1_UABH_B_StaticSwMask( (sw_id) ),
      CyUAB_SwIsClosed( (clk) ), 
      ADC_1_UABH_B_StaticSwShift( (sw_id) )
    );
}


/******************** ADC_1_UABH_B_SetSwitch() ****************************/
/*!
* @brief Consistent interface for configuring anything (switches or otherwise) 
* that can select one of the 12 UAB clocks or can be statically set open or closed.
* 
* @details 
* Unpacks @p sw_id to get switch control field location (register offset and field 
* shift value) and sets that location to @p clk.
*
* @param sw_id represents a switch encoded with its reg field location
* @param clk switch setting
* 
* @internal
* @reglist @reg MANY
* @image html test123.png 
* @endinternal
* 
* @sideeffect None
*//*==========================================================================*/
void ADC_1_UABH_B_SetSwitch(CyUAB_sw_id_enum sw_id, CyUAB_clk_enum clk)
{
    ADC_1_UABH_B_SET_FIELD(
      ADC_1_UABH_B_GetDynamicSwAddr( (sw_id) ),
      ADC_1_UABH_B_DynamicSwMask( (sw_id) ),
      ((uint32)((clk))), 
      ADC_1_UABH_B_DynamicSwShift( (sw_id) )
    ); 
}

/* [] END OF FILE */

